RoodsBurger/brushless_lamp/s3/m4-matter/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

## XIAO S3 USB — same USB_SERIAL_JTAG path as C6 (no TinyUSB). Serial from Arduino
## also routes here via -DARDUINO_USB_MODE=1 in main/CMakeLists.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

## 8 MB flash. PSRAM deliberately off — the working C6 M4 reference has no PSRAM
## and the BT controller allocates from INTERNAL|DMA capabilities regardless of
## NIMBLE_MEM_ALLOC_MODE (bt.c:BLE_CONTROLLER_MALLOC_CAPS pins it), so PSRAM never
## helps the bt_controller_init path. The real BLE-init crash we hit was not a
## memory shortage but Arduino's initArduino() calling esp_bt_controller_mem_release
## before Matter comes up — fixed via the btInUse() weak override in matter_app.cpp.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_SPIRAM is not set

## Production cred hooks all deferred — when the factory-data partition isn't
## flashed, CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=y makes GetSetupDiscriminator
## fail with CHIP_ERROR_INVALID_ARGUMENT and the BLE advert gets the wrong
## discriminator, so controller apps can't find the device. Without this flag,
## CHIP uses DeviceInstanceInfoProviderImpl + CommissionableDataProviderImpl which
## fall back to clean test defaults (VID 0xFFF1 / PID 0x8000 / passcode 20202021 /
## discriminator 3840). Phase 16 will re-enable this with real esp-matter-mfg-tool creds.
# CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER is not set
# CONFIG_SEC_CERT_DAC_PROVIDER is not set
# CONFIG_SEC_CERT_COMMISSIONABLE_DATA_PROVIDER is not set
